using System;

/*
 * Напишите команду вызова функции c именем _getch, в которую не
 * передается никаких параметров. 
 *
 * Пример из урока:  вызов функции printf c одним параметром.
 * printf("Hello, World!\n");
 *
 * Не помните, как вызвать функцию без параметров?  Повторите урок.
 * Второй параграф над Листингом 8.
 */

namespace step_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("_getch();");
        }
    }
}
