using System;

/*
 * Сопоставьте термины и их определения.
 */

namespace step_2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Информационные процессы - Процессы, связанные с изменением информации или действиями с использованием информации");
            Console.WriteLine("Информационная деятельность - Деятельность человека, связанная с процессами сбора, представления, обработки, хранения и передачи информации");
            Console.WriteLine("Обработка информации - Целенаправленный процесс изменения содержания или формы представления информации");
            Console.WriteLine("Структурирование - Организация информации по некоторому правилу, связывающему её в единое целое");
            Console.WriteLine("Кодирование - переход от одной формы представления информации к другой, более удобной для восприятия, хранения, передачи или обработки информации");
        }
    }
}
