using System;

/*
 * Задачи
 * Важной частью курса является закрепление изученного материала через
 * решение задач. И именно по результатам решения задач вам будет
 * поставлена оценка за курс. На шагах с задачами рядом с полем ответа
 * приводится число баллов, которое вы получите за её решение, а также
 * набранный вами балл.
 *
 * Все задачи можно решать любое количество раз. За неверные попытки
 * баллы не снижаются, не бойтесь ошибаться! Также, все ваши прошлые
 * решения остаются доступны по ссылке под полем задачи.
 *
 * Вопрос: как называется этот курс? Чтобы ответить, нажмите на
 * зелёное поле ниже и выберите правильный ответ.
 *
 */

namespace step_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Введение в Linux");
        }
    }
}
