using System;

/*
 * На уроках семиклассницы Аня, Юля, Даша, Ира и Вика рисовали
 * цветы: синий василёк, красную розу, желтую розу, красную
 * гвоздику-травянку и желтый одуванчик. Аня и Юля рисовали одинаковые
 * цветы, а Юля и Вика раскрашивали свои цветы одной краской. Желтыми
 * были цветы Иры и Ани. Что нари­совала каждая из девочек?
 */

namespace step_5
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Аня - жёлтая роза");
            Console.WriteLine("Юля - красная роза");
            Console.WriteLine("Даша - синий василёк");
            Console.WriteLine("Ира - жёлтый одуванчик");
            Console.WriteLine("Вика - красная гвоздика-травянка");
        }
    }
}
