using System;

/*
 * Ваши друзья жалуются, что с вашего аккаунта во ВКонтакте
 * приходит спам. Ваши действия?
 */

namespace step_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("сменю пароль от учётной записи во ВКонтакте, от почты, к которой привязан этот аккаунт, и пройдусь по компьютеру антивирусом");
            Console.WriteLine("попрошу друзей не переходить по ссылкам, которые приходят от меня, и напишу в техподдержку");
        }
    }
}
