using System;

/*
 * Три ученика ноябрьской школы: Сергей, Максим и Артём выбрали для
 * себя профессии будущего. Каждый из них занимается любимым делом:
 * один готовится быть инженером роботизированных систем, другой -
 * сити-фермером, третий - проектировщиком нейроинтерфейсов. В разное
 * время были записаны следующие сказанные ими фразы:
 *
 *       1. Артём, сегодня я занят: должен осмотреть свой нейрошлем,
 *       ведь скоро начнутся испытания.
 *       2. Максим, я видел, как ты заботишься о конструкции, и
 *       подумал, что заставить её эффективно работать не легче, чем
 *       мне - гидропонную установку.
 *       3. Завтра я занят, Максим, буду отлаживать работу всех
 *       программных систем своего нейрошлема.
 * Какой профессией будущего овладевает каждый из ребят?
 */

namespace step_6
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Сергей - проектировщик нейроинтерфейсов");
            Console.WriteLine("Максим - инженер роботизированных систем");
            Console.WriteLine("Артём - сити-фермер");
        }
    }
}
