using System;

/*
 * Вы можете скачать и изучить скрипты, которые мы показали в
 * видеофрагменте: math1.sh, math2.sh.
 *
 * Какие(ая) из предложенных ниже инструкций увеличат значение
 * переменной а на значение переменной b? Например, если в а было
 * записано 10, в b было 5, то в а должно записаться 15. 
 * Выберите все подходящие варианты!
 */

namespace step_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("let \"a+=b\"");
            Console.WriteLine("let a=a+b");
        }
    }
}
