using System;

/*
 * 48.0 школьников из двух классов учились программировать в
 * специализированном летнем лагере. Каждый научился программировать
 * или на языке Python, или на языке C++, а некоторые школьники после
 * смены могут программировать и на языке Python, и на языке C++.
 * Сколько школьников освоили оба языка программирования, если
 * известно, что на языке Python хорошо программируют 37.0 школьников,
 * а на языке C++ 22.0 школьников?
 */

namespace step_7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine(37 + 22 - 48);
        }
    }
}
