using System;

/*
 * Напишите строку программы с директивой препроцессора для
 * подключения файла conio.h
 */

namespace step_2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("#include <conio.h>");
        }
    }
}
