using System;

/*
 * После каникул ноябрьские школьники - Андрей, Дмитрий, Артём и
 * Сергей - встретились в квартире у Артёма. Друзья были рады встрече
 * и каждый рассказывал о том, в каком летнем лагере он побывал.
 *
 * - Ну, как твои успехи в спортивном программировании, Новиков?
 * - спросил Дмитрий.
 *
 * - Норм, - ответил Новиков, - хочешь попробуем в следующем
 * контесте с тобой и Андреем?
 * 
 * - А я, посмотрите, какого робота собрал, - сказал Новожилов,
 * прерывая разговор друзей и внося из своей комнаты интересную
 * конструкцию.
 *
 * Всем, особенно Соколову и Андрею, робот очень понравился. А
 * Смирнов обещал всех научить паять, а не просто собирать роботов
 * из готовых конструкторов.
 *
 * Назовите имя и фамилию каждого мальчика.
 */

namespace step_7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Андрей - Смирнов");
            Console.WriteLine("Дмитрий - Соколов");
            Console.WriteLine("Артём - Новожилов");
            Console.WriteLine("Сергей - Новиков");
        }
    }
}
