using System;

/*
 * Сопоставь термины и их определения.
 */

namespace step_2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Информация для человека - Сообщение, воспринимаемое человеком и расширяющее знание об окружающем мире и протекающих в нём процессах");
            Console.WriteLine("Непрерывый сигнал - Сигнал, принимающий бесконечное множество значений из некоторого диапазона. Между значениями, которые он принимает нет разрывов");
            Console.WriteLine("Дискретный сигнал - Сигнал, принимающий конечное число значений. Все значения дискретного сигнала можно пронумеровать целыми числами.");
        }
    }
}
