using System;

/*
 * Виды информации по способу восприятия.
 *
 * Сопоставь термины и определения
 */

namespace step_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Визуальная - Информация, воспринимаемая с помощью органов зрения.");
            Console.WriteLine("Обонятельная - Информация, воспринимаемая с помощью органов обоняния.");
            Console.WriteLine("Вкусовая - Информация, воспринимаемая с помощью вкусовых рецепторов языка.");
            Console.WriteLine("Аудиальная - Информация, воспринимаемая с помощью органов слуха.");
            Console.WriteLine("Тактильная - Информация, воспринимаемая с помощью органов осязания");
        }
    }
}
