using System;

/*
 * Напишите строку для полного (со всеми файлами и поддиректориями)
 * удаления директории /home/box
 */

namespace step_8
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("rm -rf /home/box");
        }
    }
}
