using System;

/*
 * Напишите команду для создания псевдонима для команды "ls -lh",
 * и назовите псевдоним "lh".
 */

namespace step_7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("alias lh=\"ls -lh\"");
        }
    }
}
