using System;

/*
 * Сопоставьте утилиты с их функциями
 */

namespace step_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("date используется для вывода информации о дате, времени, часовом поясе, а также дополнительной информации.");
            Console.WriteLine("locate предназначена для поиска файлов, использует данные индексирования файловой системы.");
            Console.WriteLine("time выводит информацию о том, сколько времени тратится на исполнение заданной команды.");
            Console.WriteLine("find предназначена для поиска файлов, может выполнять произвольные команды для обработки найденных файлов.");
            Console.WriteLine("cal выводит календарь для выбранного месяца.");
        }
    }
}
