using System;

/*
 * Укажите жизненные ситуации, в которых осуществляется хранение
 * информации.
 */

namespace step_7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Пятиклассница заучивает стихотворение наизусть");
            Console.WriteLine("Туристы фотографируются на фоне достопримечательностей");
            Console.WriteLine("Мама сохраняет в своём мобильном телефоне номер классного руководителя");
        }
    }
}
