using System;

/*
 * Определите вид информации в следующих ситуациях (установите
 * соответствие)
 */

namespace step_9
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Лиза пьёт горькую микстуру - Вкусовая");
            Console.WriteLine("Ваня читает книгу - Зрительная");
            Console.WriteLine("Витя ныряет в реку - Осязательная");
            Console.WriteLine("Саша слушает радионовости - Звуковая");
            Console.WriteLine("Вася вдыхает аромат свежеиспечённой булочки - Обонятельная");
        }
    }
}
