using System;

/*
 * Название каждой профессии сопоставьте с описанием возможностей
 * компьютера в соответствующей сфере деятельности.
 */

namespace step_12
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine(" - ");
            Console.WriteLine("Композитор - Создание, обработка, исполнение музыкальных композиций");
            Console.WriteLine("Художник - Создание новых изображений, изменение имеющихся рисунков и фотографий");
            Console.WriteLine("Библиотекарь - Формирование каталогов; хранение книг, газет и журналов в электронной форме; быстрый поиск и доступ к нужному материалу");
            Console.WriteLine("Почтальон - Доставка сообщений адресату в любую точку планеты");
            Console.WriteLine("Дизайнер - Создание интерьеров, подбор фактуры и цвета отделочных материалов, расположение предметов");
            Console.WriteLine("Архитектор - Проектирование новых зданий и сооружений, создание чертежей");
            Console.WriteLine("Бухгалтер - Быстрый расчёт заработной платы, учёт доходов и налогов, подготовка документации");
            Console.WriteLine("Мультипликатор - Создание движущихся изображений, спецэффектов");
            Console.WriteLine("Врач - Обследование, диагностика, назначение лечения");
            Console.WriteLine("Конструктор - Проектирование и расчёт характеристик новых механизмов и конструкций");
            Console.WriteLine("Переводчик - Выполнение перевода отдельных слов, фраз и текстов с одного языка на другой");
            Console.WriteLine("Модельер - Разработка новых моделей одежды и обуви, подготовка выкроек");
            Console.WriteLine("Учитель - Демонстрация изучаемого материала в наглядной форме, проведение экспериментов, проверка знаний");
        }
    }
}
