using System;

/*
 * Сопоставь термины и их описания
 */

namespace step_5
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Позиционная система счисления - В этой системе счисления количественное значение цифры зависит от её положения в записи числа.");
            Console.WriteLine("Унарная система счисления - В этой системе счисления для записи любых чисел используется всего один символ.");
            Console.WriteLine("Непозиционная система счисления - В этой системе счисления количественное значение цифры не зависит от её положения в записи числа.");
        }
    }
}
