using System;

/*
 * В Иннополис на робототехническую олимпиаду приехали пятеро
 * ямальских ребят из Салехарда, Нового Уренгоя, Ноябрьска, Надыма
 * и Тарко-Сале: Аркадий, Борис, Витя, Гриша и Дима. Они обедали за
 * круглым столом: салехардец - между таркосалинцем и Димой,
 * новоуренгоец - между Аркадием и Борисом, а напротив него -
 * надымчанин и Витя. Гриша не был в Новом Уренгое, Аркадий - ни в
 * Салехарде, ни в Тарко-Сале. Таркосалинец с Борисом, сидя рядом,
 * много разговаривали.
 *
 * Определите в каком городе живёт каждый из ребят.
 */

namespace step_8
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Аркадий - Ноябрьск");
            Console.WriteLine("Борис - Салехард");
            Console.WriteLine("Витя - Тарко-Сале");
            Console.WriteLine("Гриша - Надым");
            Console.WriteLine("Дима - Новый Уренгой");
        }
    }
}
