using System;

/*
 * Переведи число 170 из десятичной системы счисления в
 * шестнадцатеричную. В ответе запишите полученное шестнадцатеричное
 * число. Основание системы счисления писать не нужно.
 */

namespace step_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("{0} - {0:X}", 170);
        }
    }
}
