using System;

/*
 * По запросу [Джобс & Гейтс] найдено 3.0 млн. документов.
 * По запросу [Джобс] найдено 33.0 млн. документов. По запросу [Гейтс]
 * найдено 38.0 млн. документов. Сколько миллионов документов будет
 * найдено по запросу [Джобс | Гейтс]? Решите задачу, используя круги
 * Эйлера. В ответ запишите только класс миллионов, разряды других
 * классов писать не нужно.
 */

namespace step_2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine(33 + 38 - 3);
        }
    }
}
