using System;

/*
 * Шестнадцатеричная система счисления
 * Переведи число BF из шестнадцатеричной системы счисления в
 * десятичную. В ответе запишите полученное шестнадцатеричное число.
 * Основание системы счисления писать не нужно.
 */

namespace step_7
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("{0} - {1}", "BF", 0xBF);
        }
    }
}
