using System;

/*
 * Сопоставьте фильтры с определениями
 */

namespace step_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("cut извлекает данные из столбцов файлов-таблиц с указанием разделителя или количества байт в столбцах");
            Console.WriteLine("sort сортирует строки в соответствии с заданными условиями");
            Console.WriteLine("comm сравнивает потоки данных или файлы");
            Console.WriteLine("wс подсчитывает строки, слова и символы");
            Console.WriteLine("grep фильтрует текст построчно, по вхождению подстрок");
            Console.WriteLine("tr преобразует символы по заданному шаблону; преобразует последовательности одинаковых символов в один символ");
            Console.WriteLine("uniq удаляет повторяющиеся строки, подсчитывает повторения строк");
        }
    }
}
