using System;

/*
 * В вашей ленте в соцсети вы увидели перепост объявления
 * благотворительного фонда, который собирает средства на какое-то
 * небезразличное вам дело. Вы решаете перевести деньги — что вы
 * будете делать?
 */

namespace step_6
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("сначала поищете оригинальный пост фонда и сверите номера кошельков, для верности сходите на сайт фонда и поищите там описание акции, в которой хотите поучаствовать. После это сделаете перевод.");
        }
    }
}
