using System;

/*
 * Напишите в одну строку команды, которые последовательно выполнят
 * следующие действия, вне зависимости от результата выполнения
 * команд:
 *
 * Вывести имя текущей директории (pwd).
 * Вывести список содержимого текущей директории (ls).
 */

namespace step_8
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("pwd; ls");
        }
    }
}
