using System;

/*
 * Четыре подруги пришли на каток, каждая со своим братом. Они
 * разбились на пары и начали кататься. Оказалось, что в каждой паре
 * «кавалер» выше «дамы» и никто не катается со своей сестрой. Самым
 * высоким в компании был Юра Воробьёв, следующим по росту —
 * Андрей Егоров, потом Люся Егорова, Серёжа Петров, Оля Петрова,
 * Дима Крымов, Инна Крымова и Аня Воробьёва.
 *
 * Определите, кто с кем катался?
 */

namespace step_10
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Аня Воробьёва - Дима Крымов");
            Console.WriteLine("Оля Петрова - Андрей Егоров");
            Console.WriteLine("Люся Егорова - Юра Воробьёв");
            Console.WriteLine("Инна Крымова - Серёжа Петров");
        }
    }
}
