using System;

/*
 * Критерии прохождения курса по Linux
 * Рядом с каждым тестом и задачей указано количество баллов, которое
 * вы получите за правильное решение. Ваш общий прогресс также
 * отображается в оглавлении курса, там же видны и сроки сдачи каждой
 * из задач. 
 *
 * Суммарная стоимость всех задач составляет 140 баллов.
 *
 * Для получения сертификата по курсу необходимо набрать 115 баллов,
 * для сертификата с отличием — 130 баллов. Когда Вы наберёте 115
 * баллов, в течение суток Вам придёт сертификат, а если будете решать
 * задания и получать баллы дальше — он будет автоматически обновляться.
 *
 * Внимание: дедлайнов по этому курсу нет, то есть вы можете
 * просматривать материалы и решать задачи в удобном для вас режиме.
 * Но если вы действительно хотите пройти этот курс, советуем вам
 * заниматься регулярно, и проходить хотя бы по несколько уроков в день.
 *
 * Удачи!
 *
 * И пожалуйста, отметьте ниже ВСЕ верные утверждения.
 */

namespace step_5
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Я не буду распространять и выкладывать в открытом доступе свои решения задач курса, чтобы другим оставалось интересно их решать самостоятельно.");
            Console.WriteLine("Я буду работать над задачами курса самостоятельно, чтобы извлечь для себя максимальную пользу от курса.");
            Console.WriteLine("Дедлайнов по курсу нет, но я постараюсь проходить уроки регулярно, чтобы изучить Linux");
        }
    }
}
