using System;

/*
 * Утилита chage может быть использована для
 */

namespace step_5
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("установки даты истечения срока действия пользовательской учетной записи");
            Console.WriteLine("установки количества дней, в течение которых выводятся предупреждения об истечении срока действия пароля");
            Console.WriteLine("даты истечения срока действия пароля");
            Console.WriteLine("установки минимального и максимального срока действия пароля");
        }
    }
}
