using System;

/*
 * Давайте быстренько пробежимся по основным понятиям, описанным
 * в предыдущих шагах.
 * Сопоставьте части высказываний максимально корректным образом.
 */

namespace step_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Любой объект может содержать свойства и методы");
            Console.WriteLine("Некоторая величина при объекте называется свойство");
            Console.WriteLine("Часть кода, присвоенная свойству объекта это метод");
            Console.WriteLine("В метод можно передать аргумент");
            Console.WriteLine("Метод обязательно должен входить в какой-либо объект");
        }
    }
}
