using System;

/*
 * Критерии прохождения курса по Python
 * Рядом с каждым тестом и задачей указано количество баллов,
 * которое вы получите за правильное решение. Ваш общий прогресс
 * также отображается в оглавлении курса, там же видны и сроки
 * сдачи каждой из задач.
 *
 * Суммарная стоимость всех базовых задач составляет 94 балла.
 * Дополнительные 6 баллов можно набрать за решение задач на
 * программирование повышенной сложности.
 *
 * Для получения сертификата по курсу необходимо набрать 80 баллов,
 * для сертификата с отличием — 90 баллов. Как только наберёте 80
 * баллов, в течение суток автоматически получите сертификат, а
 * потом баллы в нём будут сами обновляться по мере решения новых задач. 
 *
 * Внимание, дедлайнов по этому курсу нет, то есть вы можете
 * просматривать материалы и решать задачи в удобном для вас режиме.
 * Но если вы действительно хотите пройти этот курс, советуем вам
 * заниматься регулярно, и проходить хотя бы по несколько уроков в день.
 *
 * И пожалуйста, отметьте ниже все верные утверждения (подсказка:
 * "останутся").
 */

namespace step_6
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Я не буду распространять и выкладывать в открытом доступе решения задач курса, чтобы другим учащимся было интересно решать эти задачи самостоятельно.");
            Console.WriteLine("Дедлайнов по курсу нет, но я постараюсь проходить уроки регулярно, чтобы успешно изучить Python");
            Console.WriteLine("Я буду работать над задачами курса самостоятельно, чтобы извлечь для себя максимальную пользу от курса.");
            Console.WriteLine("Материалы курса открыты для работы в свободном режиме");
        }
    }
}
