using System;

/*
 * Свойства информации
 *
 * Сопоставьте свойства информации и их описания.
 */

namespace step_5
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Понятность - Информация выражена на языке, доступном для получателя");
            Console.WriteLine("Актуальность - Информация важна, существенна в настоящий момент времени");
            Console.WriteLine("Достоверность - Информация отражает истинное положение дел");
            Console.WriteLine("Полнота - Информации достаточно для понимания ситуации и принятия решения");
            Console.WriteLine("Полезность - Информация позволяет получателю решать стоящие перед ним задачи");
            Console.WriteLine("Объективность - Информация не зависит от чьего-либо мнения");
        }
    }
}
