using System;

/*
 * Повторим двоичную систему счисления
 * Переведи число 11001011 из двоичной системы счисления в десятичную.
 * В ответе запишите полученное десятичное число. Основание системы
 * счисления писать не нужно.
 */

namespace step_6
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("{0} - {1}", "11001011", 0b11001011);
        }
    }
}
