using System;

/*
 * В соцсети незнакомый человек попросил вас перевести деньги на
 * электронный кошелёк — его собаке срочно нужна дорогая операция.
 * Как вы поступите?
 */

namespace step_5
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("прежде чем что-либо предпринять, проверите номер кошелька в интернете — возможно, на него принимают и другие переводы, например, платежи за дешёвые авиабилеты или какие-нибудь услуги;");
        }
    }
}
