using System;

/*
 * Напишите команду, которую необходимо ввести, чтобы получить
 * справку по утилите ls.
 */

namespace step_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("man ls");
        }
    }
}
