using System;

/*
 * Каждому термину, указанному в левой колонке, поставьте в
 * соответствие его описание, приведённое в правой колонке.
 */

namespace step_12
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Принтер - Устройство для печати информации на бумаге");
            Console.WriteLine("Монитор - Устройство визуального отображения информации");
            Console.WriteLine("Мышь - Устройство для быстрого перемещения по экрану и выбора нужной информации");
            Console.WriteLine("Аппаратное обеспечение - Совокупность всех устройств компьютера");
            Console.WriteLine("Информация - Сведения об интересующем вас предмете");
            Console.WriteLine("Процессор - Устройство, предназначенное для вычислений, обработки информации и управления работой компьютера");
            Console.WriteLine("Клавиатура - Устройство для ввода информации путём нажатия клавиш");
            Console.WriteLine("Данные - Информация, представленная в форме, пригодной для обработки компьютером");
            Console.WriteLine("Компьютер - Универсальное программно управляемое устройство для обработки информации");
            Console.WriteLine("Оперативная память - Информация в ней находится только во время работы компьютера");
            Console.WriteLine("Жёсткий диск - Используется для длительного хранения информации");
        }
    }
}
