using System;

/*
 * В новом учебном году в школе №7 города Ноябрьска будут работать
 * три новых учителя: информатик Белов, математик Черных и физик
 * Рыженьков. На перемене они впервые встретились вместе в
 * учительской. "Вы заметили", - сказал брюнет, - "из нас один рыжий,
 * другой блондин, а третий - я, но ни у одного из нас цвет волос и
 * фамилия не совпали, забавно?" - "Ты прав", - подтвердил информатик.
 * Какого цвета волосы у каждого из учителей?
 */

namespace step_4
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("информатик - рыжий");
            Console.WriteLine("математик - блондин");
            Console.WriteLine("физик - брюнет");
        }
    }
}
