using System;

/*
 * Внимательно прочитайте русские приметы. Каждой примете поставьте
 * в соответствие органы чувств, обеспечивающие человека
 * соответствующими данными.
 */

namespace step_15
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Осы сильно кусаются – к похолоданию. - Кожа");
            Console.WriteLine("В ненастную погоду птицы защебетали – к наступлению ясной погоды. - Уши");
            Console.WriteLine("У речки пахнет свежей рыбой – к дождю. - Нос");
            Console.WriteLine("Луна ясная и круглая летом – к хорошей погоде, зимой – к стуже. - Глаза");
        }
    }
}
