using System;

/*
 * Информация - это...
 *
 *  1. Совокупность знаний о фактических данных и зависимостях между ними.
 *  2. Всё то, что так или иначе зафиксировано в знаковой форме.
 *  3. Полученные сведения, являющиеся новыми и доступными.
 *  4. Количественная мера устранения неопределённости.
 *  5. Сведение об окружающем мире и протекающих в нём процессах, воспринимаемые человеком или специальными устройствами.
 * Заполните таблицу, ответив на вопросы с позиций каждого из приведённых выше определений.
 */

namespace step_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в Википедии? - Полученные сведения, являющиеся новыми и доступными");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в Википедии? - Совокупность знаний о фактических данных и зависимостях между ними");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в Википедии? - Количественная мера устранения неопределённости");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в Википедии? - Всё то, что зафиксировано в знаковой форме");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в Википедии? - Сведение об окружающем мире и протекающих в нём процессах, воспринимаемые человеком или специальными устройствами");
            Console.WriteLine("Являются ли информацией: нерасшифрованные послания? - Всё то, что зафиксировано в знаковой форме");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в учебнике, который вы читаете повторно? - Совокупность знаний о фактических данных и зависимостях между ними");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в учебнике, который вы читаете повторно? - Количественная мера устранения неопределённости");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в учебнике, который вы читаете повторно? - Всё то, что зафиксировано в знаковой форме");
            Console.WriteLine("Являются ли информацией: сведения, содержащиеся в учебнике, который вы читаете повторно? - Сведение об окружающем мире и протекающих в нём процессах, воспринимаемые человеком или специальными устройствами");

        }
    }
}
