using System;

/*
 * Задание на самостоятельное изучение tmux. 
 *
 * Изучите справку по tmux (например, man tmux) и выберите из
 * предложенных ниже tmux-команд ту, которая отвечает за
 * переименование текущей вкладки.
 */

namespace step_18
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Ctrl+B и , (запятая)");
        }
    }
}
